import type { News } from "@/type/type";

export const newss: News[] = [
  {
    slug: "1",
    title: "Заголовок Новости",
    subtitle:
      "Описание новости в коротком формате, чтобы немного ввести в курс дела.",
    description:
      "Описание новости в коротком формате, чтобы немного ввести в курс дела.",
    cover: "/news/1.png",
    image: "/news/1.png",
    date: "14.05.2025",
    href: "/news/1",
    content: [
      {
        text: "Реализация проекта, представленная планирование обеспечивает широкому кругу участие...",
      },
      {
        title: "Заголовок 2",
        text: "Реализация проекта, представленная планирование обеспечивает широкому кругу участие...",
      },
      {
        title: "Заголовок 2",
        text: "Реализация проекта, представленная планирование обеспечивает широкому кругу участие...",
      },
    ],
  },
  {
    slug: "2",
    title: "Заголовок Новости",
    subtitle:
      "Описание новости в коротком формате, чтобы немного ввести в курс дела.",
    description:
      "Описание новости в коротком формате, чтобы немного ввести в курс дела.",
    cover: "/news/1.png",
    image: "/news/1.png",
    date: "14.05.2025",
    href: "/news/1",
    content: [
      {
        text: "Реализация проекта, представленная планирование обеспечивает широкому кругу участие...",
      },
      {
        title: "Заголовок 2",
        text: "Реализация проекта, представленная планирование обеспечивает широкому кругу участие...",
      },
      {
        title: "Заголовок 2",
        text: "Реализация проекта, представленная планирование обеспечивает широкому кругу участие...",
      },
    ],
  },
  {
    slug: "3",
    title: "Заголовок Новости",
    subtitle:
      "Описание новости в коротком формате, чтобы немного ввести в курс дела.",
    description:
      "Описание новости в коротком формате, чтобы немного ввести в курс дела.",
    cover: "/news/1.png",
    image: "/news/1.png",
    date: "14.05.2025",
    href: "/news/1",
    content: [
      {
        text: "Реализация проекта, представленная планирование обеспечивает широкому кругу участие...",
      },
      {
        title: "Заголовок 2",
        text: "Реализация проекта, представленная планирование обеспечивает широкому кругу участие...",
      },
      {
        title: "Заголовок 2",
        text: "Реализация проекта, представленная планирование обеспечивает широкому кругу участие...",
      },
    ],
  },
];
